{"﻿Lucas Berry \nMontreal, QC | P: 310-570-6909 | lucasdberry@gmail.com\nEDUCATION\nMcGill University\nMontreal, QC\nDoctorate of Philosophy: Computer Science\nExpected December 2024\nAdvisor: David Meger \nAreas of Study: Uncertainty Estimation, Normalizing Flows, Diffusion Models Research Projects:\n●\nSafe Reinforcement Learning for Autonomous Driving\n●\nExpressive Aleatoric Normalizing Flow Ensembles Models with Accurate Epistemic Uncertainty\n●\nPairwise Distances to Estimate Epistemic Uncertainty for Probabilistic Ensembles\n●\nEpistemic Uncertainty Estimation for Image Generation for Diffusion Models\nConcordia University\nMontreal, QC\nMasters of Arts: Mathematics\nDecember 2016\nAdvisor: Jose Garrido \nAreas of Study: Machine Learning, Hidden Markov Models, Actuarial Science \nThesis:\nUniversity of British Columbia\nVancouver, BC\nBachelors of Arts: Mathematics Major, Psychology Minor\nApril 2013\nAverage in Math Courses 83% (A-)\nWORK EXPERIENCE\nBirds of Color Algorithms (Algorithmic Trading Startup) Founding Partner\nMontreal, QC \nJun 2017 – Present\n●Utilized proficiency in Machine Learning to train neural network models for NHL betting, resulting in a \tnotable 2.13% profit in 2023 and a sustained increase of 6.79% in 2024.\n●Engineered automated systems employing Beautiful Soup, Selenium and Pandas to systematically collect and \tclean NHL statistics, amassing a dataset spanning 15 years and encompassing over 18,000 games.\n●Created a semi-automated notification system, promptly alerting users to opportune betting scenarios via email, \tand logging bets following user execution.\n●Leveraged expertise in reinforcement learning to build a robust pipeline for stock trading, leveraging 20 years of \thistorical stock data. Successfully trained a reinforcement learning agent to buy and hold Google stock.\n●Successfully managed and recruited a team of two individuals, organized meetings twice a week to coordinate collaborative efforts, formulated impactful business strategies, and outlined a roadmap for the business's future development.\nMcGill University (Department of Family Medicine) Research Assistant\nMontreal, QC \nApr 2017 – May 2022\n●Built an application that facilitated the analysis of statistical outcomes in 3+3 phase 1 drug trials. This user-friendly platform empowered practitioners by integrating a Bayesian framework, allowing seamless incorporation of prior beliefs.\n●Successfully fine-tuned a pre-trained language model (XLNet) to develop a robust fake news predictive model.\n\tOur model secured 13th place out of 300 competing teams in a nationwide competition (Fact or Fake News?).●Created a predictive model to ascertain the presence of Idiopathic Pulmonary Fibrosis from a combination of \tcovariates and CT scans. We competed in an international competition securing the 22nd position out of 2,097 \tcompeting teams.\n\nBlack Eagle Algorithms S.E.N.C. (Cryptocurrency Arbitrage) Founding Partner\nMontreal, QC \nSep 2018 – June 2019\n●Constructed a comprehensive codebase that systematically queried the APIs of 10 prominent cryptocurrency \texchanges at five-minute intervals, generating an expansive database (over 440 billion lines).\n●Leveraged this extensive dataset to conduct in-depth statistical analyses, successfully identifying and isolating \tlucrative arbitrage opportunities within the cryptocurrency market.\n●Built a fully automated trading algorithm capable of executing trades on various cryptocurrency exchanges. Returning a 4% profit monthly for 10 months until market conditions shifted unfavorably due to bankruptcy of a cryptocurrency exchange.\nConcordia University & HEC Montreal (Department of Mathematics) Course Lecturer\nMontreal, QC Sep 2015 – May 2016\n●Effectively taught classes of over 70 students (Introduction to Statistics, Calculus 1) by encouraging questions \tand explaining concepts differently to cater to various learning styles.\n●Provided individualized help before and after class, in addition to office hours, to help relieve math anxiety.\nRESEARCH PAPERS\n●Lucas Berry and David Meger. Normalizing Flow Ensembles for Rich Aleatoric and Epistemic Uncertainty \tModeling. Proceedings of the AAAI Conference on Artificial Intelligence, 37(6):6806–6814, 2023.\n●Lucas Berry and David Meger. Efficient Epistemic Uncertainty Estimation in Regression Ensemble Models Using Pairwise-Distance Estimators. In Review at Neural Information Processing Systems (NeurIPS) 2024.\n●Lucas Berry, Axel Brando and David Meger. Shedding Light on Large Generative Networks: Estimating Epistemic Uncertainty in Diffusion Models. Accepted to Conference on Uncertainty in Artificial Intelligence (UAI) 2024.\n●Faraz Lotfi, Khalil Virji, Farnoosh Faraji, Lucas Berry, Andrew Holliday, David Meger and Gregory Dudek. Uncertainty-aware hybrid paradigm of nonlinear MPC and model-based RL for offroad navigation: Exploration of transformers in the predictive model. Accepted to International Conference on Robotics and Automation (ICRA) 2024.\nCOMMUNITY INVOLVEMENT\nMentor (Tyndale St. Georges & UBC)\nJan 2012 – Jan 2017\n●Assisted high school students with their math homework by systematically breaking down complex problems \tinto more manageable and comprehensible components.\n●Cultivated strong connections with students by aligning mathematical concepts with their interests and \teffectively communicating in their preferred language (English or French).\nPresident (Math & Stat Graduate Student Association, Concordia) \tSep 2014 – Sep 2015●Built a more integrated community within the department by organizing events that featured graduate students \tand faculty.\n●Effectively managed expenditures to adhere to the fiscal budget while strategically optimizing spending.\nADDITIONAL\nCoding Skills: Python (Numpy, Pytorch, Matplotlib, Pandas, Scipy), Web Scraping (Beautiful Soup, Selenium), R, Matlab, Julia \nLanguages: Fluent in English, Conversational Proficiency in French \nCertifications: Passed 3 Actuarial Exams (P, FM, MFE) \nReviewer: NeurIPS (2023, 2024), ICML (2023, 2024), CoRL (2018), IROS (2018, 2023), ICRA (2024)":null}